setupWaveTransmission/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application shallowFoam;

//startFrom       startTime;
startFrom	latestTime;

startTime       0;

stopAt          endTime;
//stopAt	        writeNow;

endTime         20;

deltaT          0.0005;

writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;

libs (
      "libOpenFOAM.so"  // OpenFOAM will (probably) crash if this library is not specified
      //      "libsimpleSwakFunctionObjects.so"
      //      "libswakFunctionObjects.so"
      //      "libgroovyBC.so"  // Not needed now, but we will need it later when altering the boundary conditions
     );
 
functions
{
  //    #include "sampledSets"
}

// ************************************************************************* //
