setupWaveTransmission/constant/region2d/polyMesh/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:





//Lengthes


//Heights


//Width


//Slope


//Bottom elevations


//Top elevations


//plane A


//plane B


//Numbers of cells in y- and z-direction


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// plane A
	(0 0 0.8) // Vertex A0 = 0 
	(0 0.1 0.8) // Vertex A1 = 1 
	(0 0 1.8) // Vertex A2 = 2 
	(0 0.1 1.8) // Vertex A3 = 3 
	
	// plane B
	(20 0 0.8) // Vertex B2 = 4 
	(20 0.1 0.8) // Vertex B3 = 5 
	(20 0 1.8) // Vertex B4 = 6 
	(20 0.1 1.8) // Vertex B5 = 7 

);

blocks          
(
    // Section A	
    hex (0 4 5 1 2 6 7 3) (200 1 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
	patch front2d
	(
	(0 2 3 1)	
	)

	patch back2d
	(
	(4 5 7 6)
	)

	empty bottom2d
	(
	(0 1 5 4)
	)

	empty top2d
	(
	(2 6 7 3)
	)

	empty walls2d
	(
	(0 4 6 2)
	(1 3 7 5)
	)

);

mergePatchPairs
(
);

// ************************************************************************* //
