setupWaveTransmission/constant/region2d/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/region2d/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front2d
    {
        type            patch;
        nFaces          1;
        startFace       399;
    }
    back2d
    {
        type            sifMappedPatch;
        nFaces          1;
        startFace       400;
        sampleMode      nearestPatchFace;
        sampleRegion    region3d;
        samplePatch     frontA;
        offset          ( 0 0 0 );
    }
    bottom2d
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       401;
    }
    top2d
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       801;
    }
    walls2d
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       1201;
    }
)

// ************************************************************************* //
