setupWaveTransmission/0/region2d/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region2d";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(2.26978 0 0)
(2.26993 0 0)
(2.27015 0 0)
(2.27038 0 0)
(2.27063 0 0)
(2.27088 0 0)
(2.27114 0 0)
(2.27139 0 0)
...
)
;

boundaryField
{
    front2d
    {
        type            calculated;
        value           uniform (2.26985 0 0);
    }
    back2d
    {
        type            calculated;
        value           uniform (2.32796 0 0);
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
