setupWaveTransmission/0/region3d/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region3d";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
390000
(
10261.9
10246.7
10242.1
10243.1
10243.1
10242.2
10241.3
10240.2
...
)
;

boundaryField
{
    frontA
    {
        type            sifPressure;
        refValue        nonuniform List<scalar> 
300
(
10293.9
10293.9
10293.9
10293.9
10293.9
10293.9
10293.9
10293.9
...
)
;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        neighbourFieldName H;
        value           nonuniform List<scalar> 
300
(
10261.9
10262.3
10262.5
10262.6
10262.6
10262.6
10262.7
10262.7
...
)
;
    }
    frontC
    {
        type            zeroGradient;
    }
    backB
    {
        type            zeroGradient;
    }
    backC
    {
        type            zeroGradient;
    }
    bottomA
    {
        type            buoyantPressure;
        gradient        uniform 0;
        rho             rho;
        value           nonuniform List<scalar> 
1100
(
10261.9
10246.7
10242.1
10243.1
10243.1
10242.2
10241.3
10240.2
...
)
;
    }
    bottomC
    {
        type            buoyantPressure;
        gradient        uniform 0;
        rho             rho;
        value           nonuniform List<scalar> 
100
(
-8027.69
-8081.22
-8030.64
-7961.78
-7798.76
-7595.85
-7339.35
-7104.13
...
)
;
    }
    topA
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           nonuniform List<scalar> 
1100
(
0
0
0
0
0
0
0
0
...
)
;
    }
    topB
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           nonuniform List<scalar> 
100
(
-0.0307094
-0.0336803
-0.0378076
-0.0430299
-0.0491265
-0.0557366
-0.0624782
-0.0689805
...
)
;
    }
    wallsAll
    {
        type            empty;
    }
}


// ************************************************************************* //
