setupWaveTransmission/0/region2d/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2d";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
1.09487
1.09479
1.09468
1.09456
1.09444
1.09432
1.0942
1.09408
...
)
;

boundaryField
{
    front2d
    {
        type            zeroGradient;
    }
    back2d
    {
        type            sifFlowdepth;
        refValue        uniform 1.06767;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        neighbourFieldName alpha1;
        value           uniform 1.06767;
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
