setupWaveTransmission/0/region2d/HU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region2d";
    object      HU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(2.48512 0 0)
(2.48509 0 0)
(2.48508 0 0)
(2.48508 0 0)
(2.48508 0 0)
(2.48508 0 0)
(2.48508 0 0)
(2.48509 0 0)
...
)
;

boundaryField
{
    front2d
    {
        type            fixedValue;
        value           uniform (2.4852 0 0);
    }
    back2d
    {
        type            sifDischarge;
        refValue        uniform ( 2.4852 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform 0;
        neighbourFieldName alpha1;
        value           uniform (2.48549 0 0);
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
