setupWaveTransmission/0/region2d/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2d";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
-5e-05
-0.00015
-0.00025
-0.00035
-0.00045
-0.00055
-0.00065
-0.00075
...
)
;

boundaryField
{
    front2d
    {
        type            fixedValue;
        value           uniform 0;
    }
    back2d
    {
        type            fixedValue;
        value           uniform -0.02;
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
