setupWaveTransmission/0/region2d/alphaWSS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2d";
    object      alphaWSS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
0.00697178
0.006973
0.00697457
0.00697629
0.00697806
0.00697985
0.00698166
0.00698347
...
)
;

boundaryField
{
    front2d
    {
        type            calculated;
        value           uniform 0.00697201;
    }
    back2d
    {
        type            calculated;
        value           uniform 0.00739442;
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
