setupWaveTransmission/0/region2d/froude
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/region2d";
    object      froude;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(0.692575 0 0)
(0.69265 0 0)
(0.692749 0 0)
(0.692858 0 0)
(0.692972 0 0)
(0.693087 0 0)
(0.693202 0 0)
(0.693318 0 0)
...
)
;

boundaryField
{
    front2d
    {
        type            calculated;
        value           uniform (0.692597 0 0);
    }
    back2d
    {
        type            calculated;
        value           uniform (0.719319 0 0);
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
