setupWaveTransmission/0/region2d/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region2d";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
400
(
0.0100881
0.0100881
0.0100882
0.0100884
0.0100886
0.0100887
0.0100889
0.0100891
...
)
;

boundaryField
{
    front2d
    {
        type            zeroGradient;
    }
    back2d
    {
        type            zeroGradient;
    }
    bottom2d
    {
        type            empty;
    }
    top2d
    {
        type            empty;
    }
    walls2d
    {
        type            empty;
    }
}


// ************************************************************************* //
