setupWaveTransmission/0/region3d/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
390000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    frontA
    {
        type            sifAlpha1;
        refValue        nonuniform List<scalar> 
300
(
1
1
1
1
1
1
1
1
...
)
;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        neighbourFieldName H;
        value           nonuniform List<scalar> 
300
(
1
1
1
1
1
1
1
1
...
)
;
    }
    frontC
    {
        type            zeroGradient;
    }
    backB
    {
        type            zeroGradient;
    }
    backC
    {
        type            zeroGradient;
    }
    bottomA
    {
        type            zeroGradient;
    }
    bottomC
    {
        type            zeroGradient;
    }
    topA
    {
        type            zeroGradient;
    }
    topB
    {
        type            zeroGradient;
    }
    wallsAll
    {
        type            empty;
    }
}


// ************************************************************************* //
