setupWaveTransmission/0/region3d/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region3d";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
390000
(
0.0644426
0.0569302
0.0529311
0.0512067
0.0509447
0.051386
0.0522149
0.0531228
...
)
;

boundaryField
{
    frontA
    {
        type            sifK;
        refValue        nonuniform List<scalar> 
300
(
0.0736611
0.0724976
0.0713525
0.0702255
0.0691163
0.0680246
0.0669502
0.0658927
...
)
;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        neighbourFieldName H;
        value           nonuniform List<scalar> 
300
(
0.0736611
0.0724976
0.0713525
0.0702255
0.0691163
0.0680246
0.0669502
0.0658927
...
)
;
    }
    frontC
    {
        type            zeroGradient;
    }
    backB
    {
        type            zeroGradient;
    }
    backC
    {
        type            zeroGradient;
    }
    bottomA
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
1100
(
0.0644426
0.0569302
0.0529311
0.0512067
0.0509447
0.051386
0.0522149
0.0531228
...
)
;
    }
    bottomC
    {
        type            zeroGradient;
    }
    topA
    {
        type            zeroGradient;
    }
    topB
    {
        type            zeroGradient;
    }
    wallsAll
    {
        type            empty;
    }
}


// ************************************************************************* //
