setupWaveTransmission/0/region3d/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region3d";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
390000
(
0.00019616
0.000179666
0.000170452
0.000166604
0.000166093
0.000167256
0.000169285
0.000171511
...
)
;

boundaryField
{
    frontA
    {
        type            zeroGradient;
    }
    frontC
    {
        type            zeroGradient;
    }
    backB
    {
        type            zeroGradient;
    }
    backC
    {
        type            zeroGradient;
    }
    bottomA
    {
        type            nutRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Cs              uniform 0.5;
        Ks              uniform 0.008;
        value           nonuniform List<scalar> 
1100
(
0.000112845
0.000106008
0.000102185
0.000100491
0.000100231
0.000100669
0.000101485
0.000102371
...
)
;
    }
    bottomC
    {
        type            zeroGradient;
    }
    topA
    {
        type            zeroGradient;
    }
    topB
    {
        type            zeroGradient;
    }
    wallsAll
    {
        type            empty;
    }
}


// ************************************************************************* //
