setupWaveTransmission/0/region3d/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/region3d";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
390000
(
226.108
212.523
204.925
201.56
201.044
201.912
203.534
205.295
...
)
;

boundaryField
{
    frontA
    {
        type            sifOmega;
        refValue        nonuniform List<scalar> 
300
(
817.243
195.927
100.853
65.1214
46.9717
36.186
29.1223
24.1787
...
)
;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        neighbourFieldName H;
        value           nonuniform List<scalar> 
300
(
817.243
195.927
100.853
65.1214
46.9717
36.186
29.1223
24.1787
...
)
;
    }
    frontC
    {
        type            zeroGradient;
    }
    backB
    {
        type            zeroGradient;
    }
    backC
    {
        type            zeroGradient;
    }
    bottomA
    {
        type            omegaWallFunction;
        refValue        nonuniform List<scalar> 
1100
(
226.108
212.523
204.925
201.56
201.044
201.912
203.534
205.295
...
)
;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           nonuniform List<scalar> 
1100
(
226.108
212.523
204.925
201.56
201.044
201.912
203.534
205.295
...
)
;
    }
    bottomC
    {
        type            zeroGradient;
    }
    topA
    {
        type            zeroGradient;
    }
    topB
    {
        type            zeroGradient;
    }
    wallsAll
    {
        type            empty;
    }
}


// ************************************************************************* //
