setupWaveTransmission/system/region2d/setSetDict
// Modified from source: http://www.cfdsupport.com/Turbomachinery-CFD-manual/node374.html
// Call with 'setSet -region <regionName> -batch <locationOfThisFile> -noVTK'

faceSet facesback2d new patchToFace back2d
