setupWaveTransmission/system/region3d/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volVectorFieldValue U      (0 0 0)
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (50 1 1.5);
        fieldValues
        (
            volScalarFieldValue alpha1 1
	    volVectorFieldValue U      (2.344 0 0)
        );
    }

    /*    boxToCell
    {
        box (20.5 -1 0.4) (41 1 0.7712925);
        fieldValues
        (
            volScalarFieldValue alpha1 0
        );
    }
    */
);

// ************************************************************************* //
